SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32BG26/Include/efr32bg26_smu.h
/* Bit fields for SMU PPUNSPATD1 */
#define _SMU_PPUNSPATD1_RESETVALUE                 0xFFFFFFFFUL                               /**< Default value for SMU_PPUNSPATD1            */
#define _SMU_PPUNSPATD1_MASK                       0xFFFFFFFFUL                               /**< Mask for SMU_PPUNSPATD1                     */
#define SMU_PPUNSPATD1_BURAM                       (0x1UL << 0)                               /**< BURAM Privileged Access                     */
#define _SMU_PPUNSPATD1_BURAM_SHIFT                0                                          /**< Shift value for SMU_BURAM                   */
#define _SMU_PPUNSPATD1_BURAM_MASK                 0x1UL                                      /**< Bit mask for SMU_BURAM                      */
#define _SMU_PPUNSPATD1_BURAM_DEFAULT              0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_BURAM_DEFAULT               (_SMU_PPUNSPATD1_BURAM_DEFAULT << 0)       /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_GPCRC                       (0x1UL << 1)                               /**< GPCRC Privileged Access                     */
#define _SMU_PPUNSPATD1_GPCRC_SHIFT                1                                          /**< Shift value for SMU_GPCRC                   */
#define _SMU_PPUNSPATD1_GPCRC_MASK                 0x2UL                                      /**< Bit mask for SMU_GPCRC                      */
#define _SMU_PPUNSPATD1_GPCRC_DEFAULT              0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_GPCRC_DEFAULT               (_SMU_PPUNSPATD1_GPCRC_DEFAULT << 1)       /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_EUSART1                     (0x1UL << 2)                               /**< EUSART1 Privileged Access                   */
#define _SMU_PPUNSPATD1_EUSART1_SHIFT              2                                          /**< Shift value for SMU_EUSART1                 */
#define _SMU_PPUNSPATD1_EUSART1_MASK               0x4UL                                      /**< Bit mask for SMU_EUSART1                    */
#define _SMU_PPUNSPATD1_EUSART1_DEFAULT            0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_EUSART1_DEFAULT             (_SMU_PPUNSPATD1_EUSART1_DEFAULT << 2)     /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_EUSART2                     (0x1UL << 3)                               /**< EUSART2 Privileged Access                   */
#define _SMU_PPUNSPATD1_EUSART2_SHIFT              3                                          /**< Shift value for SMU_EUSART2                 */
#define _SMU_PPUNSPATD1_EUSART2_MASK               0x8UL                                      /**< Bit mask for SMU_EUSART2                    */
#define _SMU_PPUNSPATD1_EUSART2_DEFAULT            0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_EUSART2_DEFAULT             (_SMU_PPUNSPATD1_EUSART2_DEFAULT << 3)     /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_EUSART3                     (0x1UL << 4)                               /**< EUSART3 Privileged Access                   */
#define _SMU_PPUNSPATD1_EUSART3_SHIFT              4                                          /**< Shift value for SMU_EUSART3                 */
#define _SMU_PPUNSPATD1_EUSART3_MASK               0x10UL                                     /**< Bit mask for SMU_EUSART3                    */
#define _SMU_PPUNSPATD1_EUSART3_DEFAULT            0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_EUSART3_DEFAULT             (_SMU_PPUNSPATD1_EUSART3_DEFAULT << 4)     /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_DCDC                        (0x1UL << 5)                               /**< DCDC Privileged Access                      */
#define _SMU_PPUNSPATD1_DCDC_SHIFT                 5                                          /**< Shift value for SMU_DCDC                    */
#define _SMU_PPUNSPATD1_DCDC_MASK                  0x20UL                                     /**< Bit mask for SMU_DCDC                       */
#define _SMU_PPUNSPATD1_DCDC_DEFAULT               0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_DCDC_DEFAULT                (_SMU_PPUNSPATD1_DCDC_DEFAULT << 5)        /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_HOSTMAILBOX                 (0x1UL << 6)                               /**< HOSTMAILBOX Privileged Access               */
#define _SMU_PPUNSPATD1_HOSTMAILBOX_SHIFT          6                                          /**< Shift value for SMU_HOSTMAILBOX             */
#define _SMU_PPUNSPATD1_HOSTMAILBOX_MASK           0x40UL                                     /**< Bit mask for SMU_HOSTMAILBOX                */
#define _SMU_PPUNSPATD1_HOSTMAILBOX_DEFAULT        0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_HOSTMAILBOX_DEFAULT         (_SMU_PPUNSPATD1_HOSTMAILBOX_DEFAULT << 6) /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_USART0                      (0x1UL << 7)                               /**< USART0 Privileged Access                    */
#define _SMU_PPUNSPATD1_USART0_SHIFT               7                                          /**< Shift value for SMU_USART0                  */
#define _SMU_PPUNSPATD1_USART0_MASK                0x80UL                                     /**< Bit mask for SMU_USART0                     */
#define _SMU_PPUNSPATD1_USART0_DEFAULT             0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_USART0_DEFAULT              (_SMU_PPUNSPATD1_USART0_DEFAULT << 7)      /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_USART1                      (0x1UL << 8)                               /**< USART1 Privileged Access                    */
#define _SMU_PPUNSPATD1_USART1_SHIFT               8                                          /**< Shift value for SMU_USART1                  */
#define _SMU_PPUNSPATD1_USART1_MASK                0x100UL                                    /**< Bit mask for SMU_USART1                     */
#define _SMU_PPUNSPATD1_USART1_DEFAULT             0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_USART1_DEFAULT              (_SMU_PPUNSPATD1_USART1_DEFAULT << 8)      /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_USART2                      (0x1UL << 9)                               /**< USART2 Privileged Access                    */
#define _SMU_PPUNSPATD1_USART2_SHIFT               9                                          /**< Shift value for SMU_USART2                  */
#define _SMU_PPUNSPATD1_USART2_MASK                0x200UL                                    /**< Bit mask for SMU_USART2                     */
#define _SMU_PPUNSPATD1_USART2_DEFAULT             0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_USART2_DEFAULT              (_SMU_PPUNSPATD1_USART2_DEFAULT << 9)      /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_SYSRTC                      (0x1UL << 10)                              /**< SYSRTC Privileged Access                    */
#define _SMU_PPUNSPATD1_SYSRTC_SHIFT               10                                         /**< Shift value for SMU_SYSRTC                  */
#define _SMU_PPUNSPATD1_SYSRTC_MASK                0x400UL                                    /**< Bit mask for SMU_SYSRTC                     */
#define _SMU_PPUNSPATD1_SYSRTC_DEFAULT             0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_SYSRTC_DEFAULT              (_SMU_PPUNSPATD1_SYSRTC_DEFAULT << 10)     /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_I2C1                        (0x1UL << 11)                              /**< I2C1 Privileged Access                      */
#define _SMU_PPUNSPATD1_I2C1_SHIFT                 11                                         /**< Shift value for SMU_I2C1                    */
#define _SMU_PPUNSPATD1_I2C1_MASK                  0x800UL                                    /**< Bit mask for SMU_I2C1                       */
#define _SMU_PPUNSPATD1_I2C1_DEFAULT               0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_I2C1_DEFAULT                (_SMU_PPUNSPATD1_I2C1_DEFAULT << 11)       /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_I2C2                        (0x1UL << 12)                              /**< I2C2 Privileged Access                      */
#define _SMU_PPUNSPATD1_I2C2_SHIFT                 12                                         /**< Shift value for SMU_I2C2                    */
#define _SMU_PPUNSPATD1_I2C2_MASK                  0x1000UL                                   /**< Bit mask for SMU_I2C2                       */
#define _SMU_PPUNSPATD1_I2C2_DEFAULT               0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_I2C2_DEFAULT                (_SMU_PPUNSPATD1_I2C2_DEFAULT << 12)       /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_I2C3                        (0x1UL << 13)                              /**< I2C3 Privileged Access                      */
#define _SMU_PPUNSPATD1_I2C3_SHIFT                 13                                         /**< Shift value for SMU_I2C3                    */
#define _SMU_PPUNSPATD1_I2C3_MASK                  0x2000UL                                   /**< Bit mask for SMU_I2C3                       */
#define _SMU_PPUNSPATD1_I2C3_DEFAULT               0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_I2C3_DEFAULT                (_SMU_PPUNSPATD1_I2C3_DEFAULT << 13)       /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_LCD                         (0x1UL << 14)                              /**< LCD Privileged Access                       */
#define _SMU_PPUNSPATD1_LCD_SHIFT                  14                                         /**< Shift value for SMU_LCD                     */
#define _SMU_PPUNSPATD1_LCD_MASK                   0x4000UL                                   /**< Bit mask for SMU_LCD                        */
#define _SMU_PPUNSPATD1_LCD_DEFAULT                0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_LCD_DEFAULT                 (_SMU_PPUNSPATD1_LCD_DEFAULT << 14)        /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_LCDRF                       (0x1UL << 15)                              /**< LCDRF Privileged Access                     */
#define _SMU_PPUNSPATD1_LCDRF_SHIFT                15                                         /**< Shift value for SMU_LCDRF                   */
#define _SMU_PPUNSPATD1_LCDRF_MASK                 0x8000UL                                   /**< Bit mask for SMU_LCDRF                      */
#define _SMU_PPUNSPATD1_LCDRF_DEFAULT              0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_LCDRF_DEFAULT               (_SMU_PPUNSPATD1_LCDRF_DEFAULT << 15)      /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_RADIOAES                    (0x1UL << 16)                              /**< RADIOAES Privileged Access                  */
#define _SMU_PPUNSPATD1_RADIOAES_SHIFT             16                                         /**< Shift value for SMU_RADIOAES                */
#define _SMU_PPUNSPATD1_RADIOAES_MASK              0x10000UL                                  /**< Bit mask for SMU_RADIOAES                   */
#define _SMU_PPUNSPATD1_RADIOAES_DEFAULT           0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_RADIOAES_DEFAULT            (_SMU_PPUNSPATD1_RADIOAES_DEFAULT << 16)   /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_SMU                         (0x1UL << 17)                              /**< SMU Privileged Access                       */
#define _SMU_PPUNSPATD1_SMU_SHIFT                  17                                         /**< Shift value for SMU_SMU                     */
#define _SMU_PPUNSPATD1_SMU_MASK                   0x20000UL                                  /**< Bit mask for SMU_SMU                        */
#define _SMU_PPUNSPATD1_SMU_DEFAULT                0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_SMU_DEFAULT                 (_SMU_PPUNSPATD1_SMU_DEFAULT << 17)        /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_SMUCFGNS                    (0x1UL << 18)                              /**< SMUCFGNS Privileged Access                  */
#define _SMU_PPUNSPATD1_SMUCFGNS_SHIFT             18                                         /**< Shift value for SMU_SMUCFGNS                */
#define _SMU_PPUNSPATD1_SMUCFGNS_MASK              0x40000UL                                  /**< Bit mask for SMU_SMUCFGNS                   */
#define _SMU_PPUNSPATD1_SMUCFGNS_DEFAULT           0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_SMUCFGNS_DEFAULT            (_SMU_PPUNSPATD1_SMUCFGNS_DEFAULT << 18)   /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_LETIMER0                    (0x1UL << 19)                              /**< LETIMER0 Privileged Access                  */
#define _SMU_PPUNSPATD1_LETIMER0_SHIFT             19                                         /**< Shift value for SMU_LETIMER0                */
#define _SMU_PPUNSPATD1_LETIMER0_MASK              0x80000UL                                  /**< Bit mask for SMU_LETIMER0                   */
#define _SMU_PPUNSPATD1_LETIMER0_DEFAULT           0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_LETIMER0_DEFAULT            (_SMU_PPUNSPATD1_LETIMER0_DEFAULT << 19)   /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_IADC0                       (0x1UL << 20)                              /**< IADC0 Privileged Access                     */
#define _SMU_PPUNSPATD1_IADC0_SHIFT                20                                         /**< Shift value for SMU_IADC0                   */
#define _SMU_PPUNSPATD1_IADC0_MASK                 0x100000UL                                 /**< Bit mask for SMU_IADC0                      */
#define _SMU_PPUNSPATD1_IADC0_DEFAULT              0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_IADC0_DEFAULT               (_SMU_PPUNSPATD1_IADC0_DEFAULT << 20)      /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_ACMP0                       (0x1UL << 21)                              /**< ACMP0 Privileged Access                     */
#define _SMU_PPUNSPATD1_ACMP0_SHIFT                21                                         /**< Shift value for SMU_ACMP0                   */
#define _SMU_PPUNSPATD1_ACMP0_MASK                 0x200000UL                                 /**< Bit mask for SMU_ACMP0                      */
#define _SMU_PPUNSPATD1_ACMP0_DEFAULT              0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_ACMP0_DEFAULT               (_SMU_PPUNSPATD1_ACMP0_DEFAULT << 21)      /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_ACMP1                       (0x1UL << 22)                              /**< ACMP1 Privileged Access                     */
#define _SMU_PPUNSPATD1_ACMP1_SHIFT                22                                         /**< Shift value for SMU_ACMP1                   */
#define _SMU_PPUNSPATD1_ACMP1_MASK                 0x400000UL                                 /**< Bit mask for SMU_ACMP1                      */
#define _SMU_PPUNSPATD1_ACMP1_DEFAULT              0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_ACMP1_DEFAULT               (_SMU_PPUNSPATD1_ACMP1_DEFAULT << 22)      /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_AMUXCP0                     (0x1UL << 23)                              /**< AMUXCP0 Privileged Access                   */
#define _SMU_PPUNSPATD1_AMUXCP0_SHIFT              23                                         /**< Shift value for SMU_AMUXCP0                 */
#define _SMU_PPUNSPATD1_AMUXCP0_MASK               0x800000UL                                 /**< Bit mask for SMU_AMUXCP0                    */
#define _SMU_PPUNSPATD1_AMUXCP0_DEFAULT            0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_AMUXCP0_DEFAULT             (_SMU_PPUNSPATD1_AMUXCP0_DEFAULT << 23)    /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_VDAC0                       (0x1UL << 24)                              /**< VDAC0 Privileged Access                     */
#define _SMU_PPUNSPATD1_VDAC0_SHIFT                24                                         /**< Shift value for SMU_VDAC0                   */
#define _SMU_PPUNSPATD1_VDAC0_MASK                 0x1000000UL                                /**< Bit mask for SMU_VDAC0                      */
#define _SMU_PPUNSPATD1_VDAC0_DEFAULT              0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_VDAC0_DEFAULT               (_SMU_PPUNSPATD1_VDAC0_DEFAULT << 24)      /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_VDAC1                       (0x1UL << 25)                              /**< VDAC1 Privileged Access                     */
#define _SMU_PPUNSPATD1_VDAC1_SHIFT                25                                         /**< Shift value for SMU_VDAC1                   */
#define _SMU_PPUNSPATD1_VDAC1_MASK                 0x2000000UL                                /**< Bit mask for SMU_VDAC1                      */
#define _SMU_PPUNSPATD1_VDAC1_DEFAULT              0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_VDAC1_DEFAULT               (_SMU_PPUNSPATD1_VDAC1_DEFAULT << 25)      /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_PCNT                        (0x1UL << 26)                              /**< PCNT Privileged Access                      */
#define _SMU_PPUNSPATD1_PCNT_SHIFT                 26                                         /**< Shift value for SMU_PCNT                    */
#define _SMU_PPUNSPATD1_PCNT_MASK                  0x4000000UL                                /**< Bit mask for SMU_PCNT                       */
#define _SMU_PPUNSPATD1_PCNT_DEFAULT               0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_PCNT_DEFAULT                (_SMU_PPUNSPATD1_PCNT_DEFAULT << 26)       /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_HFRCO1                      (0x1UL << 27)                              /**< HFRCO1 Privileged Access                    */
#define _SMU_PPUNSPATD1_HFRCO1_SHIFT               27                                         /**< Shift value for SMU_HFRCO1                  */
#define _SMU_PPUNSPATD1_HFRCO1_MASK                0x8000000UL                                /**< Bit mask for SMU_HFRCO1                     */
#define _SMU_PPUNSPATD1_HFRCO1_DEFAULT             0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_HFRCO1_DEFAULT              (_SMU_PPUNSPATD1_HFRCO1_DEFAULT << 27)     /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_HFXO0                       (0x1UL << 28)                              /**< HFXO0 Privileged Access                     */
#define _SMU_PPUNSPATD1_HFXO0_SHIFT                28                                         /**< Shift value for SMU_HFXO0                   */
#define _SMU_PPUNSPATD1_HFXO0_MASK                 0x10000000UL                               /**< Bit mask for SMU_HFXO0                      */
#define _SMU_PPUNSPATD1_HFXO0_DEFAULT              0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_HFXO0_DEFAULT               (_SMU_PPUNSPATD1_HFXO0_DEFAULT << 28)      /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_I2C0                        (0x1UL << 29)                              /**< I2C0 Privileged Access                      */
#define _SMU_PPUNSPATD1_I2C0_SHIFT                 29                                         /**< Shift value for SMU_I2C0                    */
#define _SMU_PPUNSPATD1_I2C0_MASK                  0x20000000UL                               /**< Bit mask for SMU_I2C0                       */
#define _SMU_PPUNSPATD1_I2C0_DEFAULT               0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_I2C0_DEFAULT                (_SMU_PPUNSPATD1_I2C0_DEFAULT << 29)       /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_WDOG0                       (0x1UL << 30)                              /**< WDOG0 Privileged Access                     */
#define _SMU_PPUNSPATD1_WDOG0_SHIFT                30                                         /**< Shift value for SMU_WDOG0                   */
#define _SMU_PPUNSPATD1_WDOG0_MASK                 0x40000000UL                               /**< Bit mask for SMU_WDOG0                      */
#define _SMU_PPUNSPATD1_WDOG0_DEFAULT              0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_WDOG0_DEFAULT               (_SMU_PPUNSPATD1_WDOG0_DEFAULT << 30)      /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_WDOG1                       (0x1UL << 31)                              /**< WDOG1 Privileged Access                     */
#define _SMU_PPUNSPATD1_WDOG1_SHIFT                31                                         /**< Shift value for SMU_WDOG1                   */
#define _SMU_PPUNSPATD1_WDOG1_MASK                 0x80000000UL                               /**< Bit mask for SMU_WDOG1                      */
#define _SMU_PPUNSPATD1_WDOG1_DEFAULT              0x00000001UL                               /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_WDOG1_DEFAULT               (_SMU_PPUNSPATD1_WDOG1_DEFAULT << 31)      /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */

